{
	"translation": {
		"home": "Головна",
		"news": "Новини",
		"profile": "Профіль",
		"signIn": "Увійти",
		"welcome": "Привіт! Вітаю тебе на цьому сайті!",
		"welcome_desc": "Тут ти відшукаєш дещо просте та чудове :)",
		"technologies": "Використані технології: React, TypeScript, Redux TK, React Router DOM (версія 6.4+ з новими особливостями), react-i18next та Material UI. Просто та REACTивно -:",
		"adaptive": "Цей вебсайт є адаптивним, тому з девайсами будь якої ширини можна використовувати цей сайт (мінімальна ширина: 320 пікселів, максимальна ширина: 1600 пікселів).",
		"news_t": "Сторінка з новинами",
		"news_desc": "Сторінка з новинами отримує новини за запитом (використовуючи loader) та показує їх. Redux використовується, щоб зберегти дані між рендерингами.",
		"news_task": "Користувач може видалити деякі дані та завантажити більше новин при нажатті на кнопку. Також, масив з новинами зберігається глобально, щоб запобігти втраті даних та уникнути зайвих запитів.",
		"news_limitation": "P.S. Дані з API неможливо коректно перекласти на стороні клієнта, переклад зі сторони клієнта не наданий",
		"language_t": "Змінювач мови",
		"language_desc": "Реалізований з використанням react-i18next та може змінювати мову з англійською на українську та навпаки",
		"prof_login_t": "Профіль та логін",
		"prof_login_desc": "Користувач має увійти (логін: 'admin', пароль: '12345'), щоб мати доступ до профілю. В результаті цього користувач матиме змогу бачити статичний профіль.",
		"no_news": "Новин не знайдено.",
		"load_news": "Завантажити ще",
		"load_news_error": "Сталась помилка. Причина: {{error}}",
		"no_more": "Ви побачили і видалили всі доступні новини",
		"delete": "Видалити",
		"profile_name": "Джеймс Адмін",
		"profile_title": "Власник видуманої компанії",
		"profile_location": "Місце знаходження: Кремнієва Долина",
		"profile_description": "Опис: Лорем ипсум долор сит амет, те еос вери дицерет тинцидунт, хендрерит цонституам но цум. Цу цонгуе иудицо меи. Ан граецо анимал нец, иус фугит витуперата ид. Но инвидунт еффициенди нам, ет хас дицерет цорпора елигенди, цум алтера муциус ассентиор еу. Лорем ипсум долор сит амет, те еос вери дицерет тинцидунт, хендрерит цонституам но цум. Цу цонгуе иудицо меи. Ан граецо анимал нец, иус фугит витуперата ид. Но инвидунт еффициенди нам, ет хас дицерет цорпора елигенди, цум алтера муциус ассентиор еу.",
		"profile_activities": "Активність",
		"profile_activities_desc": "Лорем ипсум долор сит амет, те еос вери дицерет тинцидунт, хендрерит цонституам но цум. Цу цонгуе иудицо меи. Ан граецо анимал нец, иус фугит витуперата ид. Но инвидунт еффициенди нам, ет хас дицерет цорпора елигенди, цум алтера муциус ассентиор еу.",
		"profile_followers": "Підписники (46)",
		"profile_settings": "Налаштування",
		"signIn_text": "Увійдіть використовуючи ваш логін та пароль",
		"signIn_login": "Логін",
		"signIn_password": "Пароль",
		"signIn_error": "Логін або пароль некоректні. Введіть дані ще раз",
		"submit": "Увійти",
		"error": "Виникла помилка. Причина: {{statusText}}",
		"error_desc": "Якщо ви вважаєте, що помилка недоречна зв'яжіться з адміністратором:"
	}
}
